In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

data = pd.read_csv("data_080.csv", encoding='cp949')
data.head()

,P1,P2,P3,P4,P5,P6,P7,B1,B2,B3,...,B165,B166,B167,C1,E1,E2,E3,E4,E5,E6
0,M,20대_후,1,1,0,0,A은행,0,0,0,...,0,0,4350000,210,0,0,11111111110,0,111111111111,1100000000
1,M,50대_후,1,0,0,0,A은행,0,0,0,...,0,0,580000,40,0,0,0,0,111110111111,10000000000
2,M,40대_후,1,1,0,0,A은행,0,0,0,...,0,0,1950000,50,0,1101101111,0,0,111101101111,101101101111
3,F,60대_초,1,1,0,0,A은행,0,0,0,...,0,0,43000000,50,0,0,0,0,111111111111,111111111111
4,M,30대_후,0,1,0,0,B은행,0,0,0,...,0,0,4910000,40,0,111111111111,0,0,111111111111,111111111111

In [2]:
data["P1"].replace(["M","F"],[0,1],inplace=True)
data["P1"]

0         0
1         0
2         0
3         1
4         0
         ..
473228    1
473229    0
473230    1
473231    0
473232    1
Name: P1, Length: 473233, dtype: int64

In [3]:
data["P2"] = data["P2"].str[:2]
data["P2"]

0         20
1         50
2         40
3         60
4         30
          ..
473228    40
473229    20
473230    40
473231    60
473232    50
Name: P2, Length: 473233, dtype: object

In [4]:
data["P7"].replace(["A은행","A증권사","B은행","B증권사"],[1,2,3,4],inplace=True)
data["P7"]

0         1
1         1
2         1
3         1
4         3
         ..
473228    3
473229    1
473230    3
473231    1
473232    3
Name: P7, Length: 473233, dtype: int64

In [5]:
data = data.astype('int')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 473233 entries, 0 to 473232
Columns: 181 entries, P1 to E6
dtypes: int32(181)
memory usage: 326.7 MB

In [6]:
import seaborn as sns
plt.style.use('fivethirtyeight')

In [ ]:
sns.heatmap(data, annot=True, fmt='d')
plt.title('heatmap', fontsize=20)
plt.show()